{"meta":{"title":"Aman Mittal's Blog","subtitle":"Node.js Blog","description":"I just find Node.js adroable...","author":"Aman Mittal","url":"http://amandeepmittal.github.io/blog"},"pages":[],"posts":[{"title":"Using Bower with Heroku","slug":"Using-Bower-with-Heroku","date":"2017-06-10T17:37:35.000Z","updated":"2017-06-10T17:37:35.000Z","comments":true,"path":"2017/06/10/Using-Bower-with-Heroku/","link":"","permalink":"http://amandeepmittal.github.io/blog/blog/2017/06/10/Using-Bower-with-Heroku/","excerpt":"Yes, I use Bower to maintain front-end dependencies (exlusively with AngularJS), mostly for my side projects. Whatever you say, Bower is good and I am too anxious to mess with npm dependencies for front-end development. Plus, I feel that maintaining front-end dependencies with Bower helps in keeping my application’s skeleton clean.","text":"Yes, I use Bower to maintain front-end dependencies (exlusively with AngularJS), mostly for my side projects. Whatever you say, Bower is good and I am too anxious to mess with npm dependencies for front-end development. Plus, I feel that maintaining front-end dependencies with Bower helps in keeping my application’s skeleton clean. So for last two of my projects, I have been using Heroku for deployment. Since I am maintaining front-end dependencies using Bower, I went through this article which is about generating buildpacks on Heroku. I find generating buildpacks adds unnecessary complexity in the process of application deployment, at least for rapid prototyping. Thus, I choose a different path. Adding Bower as an npm dependency seems an easy process and doesn’t add any kind of complexity. I find it’s great only if you are using Bower for rapid prototyping JavaScript applications. After you are done with building your application, all you have to do is add Bower as an npm dependency in package.json file and then add a script under npm scripts to execute a command that will install bower dependencies before the application is deployed on Heroku. Bower as dependency in package.json : 123\"dependencies\": &#123; \"bower\": \"1.8.0\" &#125; And then add a postinstall command in npm scripts: 123\"scripts\": &#123; \"postinstall\": \"./node_modules/bower/bin/bower install\" &#125; You can read more about customizing Heroku Build Process here. See you on Twitter Originally Publisheda at Medium.com on Dec, 29, 2016. Subscribe my Blog for more on JavaScript/Nodejs/Ionic.","categories":[],"tags":[{"name":"bower","slug":"bower","permalink":"http://amandeepmittal.github.io/blog/tags/bower/"},{"name":"heroku","slug":"heroku","permalink":"http://amandeepmittal.github.io/blog/tags/heroku/"}]},{"title":"Remove node_modules recursively","slug":"Remove-node-modules-recursively","date":"2017-06-06T12:49:48.000Z","updated":"2017-06-08T12:03:59.000Z","comments":true,"path":"2017/06/06/Remove-node-modules-recursively/","link":"","permalink":"http://amandeepmittal.github.io/blog/blog/2017/06/06/Remove-node-modules-recursively/","excerpt":"node_modules tend to take a lot of space in your local system especially if you work with Node.js or related frameworks (such as client side frameworks: React or Angular). They are the part and parcel of modern day JavaScript applications and workflow.","text":"node_modules tend to take a lot of space in your local system especially if you work with Node.js or related frameworks (such as client side frameworks: React or Angular). They are the part and parcel of modern day JavaScript applications and workflow. Each day npm registry is getting around 350 million downloads daily, at the current time of writing this post. That’s almost 2.2 billion downloads per week and you can take the calculation further. Here’s Laurie Voss (@seldo) tweet, sharing the aforementioned details: Nonetheless, after all your efforts are paid of and everything is deployed and is over cloud, either Github or some deployment service you or your client prefers, I think it will be generous to remove node_modules that take useful space on our local machines (especially, Mac users with limited GigaBytes of SSD). There’s a simple command that you can run in your terminal either in a folder or from the root. 1find . -name &quot;node_modules&quot; -exec rm -rf &apos;&#123;&#125;&apos; + This will delete node_modules folder in every local repository/directory that’s on your system so take precaution or exclude those projects that you are currently working on. However, don’t panic. Everything can be back to normal just by going into the project’s directory and running package installing command: 1npm install I have used this command earlier today it saved me up to 9 GB of space from local system over several projects. I even replaced node_modules with bower_components to do the same thing: 1find . -name &quot;bower_components&quot; -exec rm -rf &apos;&#123;&#125;&apos; + Subscribe my Blog for more on JavaScript/Nodejs/Ionic.","categories":[],"tags":[{"name":"nodejs","slug":"nodejs","permalink":"http://amandeepmittal.github.io/blog/tags/nodejs/"},{"name":"npm","slug":"npm","permalink":"http://amandeepmittal.github.io/blog/tags/npm/"},{"name":"tips","slug":"tips","permalink":"http://amandeepmittal.github.io/blog/tags/tips/"}]},{"title":"What's new in npm 5","slug":"What-s-new-in-npm-5","date":"2017-06-02T12:37:17.000Z","updated":"2017-06-08T11:26:19.000Z","comments":true,"path":"2017/06/02/What-s-new-in-npm-5/","link":"","permalink":"http://amandeepmittal.github.io/blog/blog/2017/06/02/What-s-new-in-npm-5/","excerpt":"Last month, in the very last week, npm announced the new major release for the JavaScript package manager. 5.0.0, hopefully, will be shipped with upcoming version of Nodejs as well. It seems a big step towards providing better tooling with significantly improved performance as quite a lot of developers made a switch to yarn, just because it could download the packages from the registery at a faster rate. However, this point is debatable, so let’s not get into it.","text":"Last month, in the very last week, npm announced the new major release for the JavaScript package manager. 5.0.0, hopefully, will be shipped with upcoming version of Nodejs as well. It seems a big step towards providing better tooling with significantly improved performance as quite a lot of developers made a switch to yarn, just because it could download the packages from the registery at a faster rate. However, this point is debatable, so let’s not get into it. Some of the major changes which I want to hightlight in this article and am eagerly looking forward to are: npm will --save is available by default now. See the demo with your own eyes. Running npm while offline will no longer insist on retrying network requests. npm will now immediately fall back to cache if possible, or fail. --cache-min and --cache-max have been deprecated, so, existing npm caches will no longer be used. A new --prefer-offline option will make npm skip any conditional requests for stale cache data, and only hit the network if something is missing from the cache. A new --prefer-online option that will force npm to revalidate cached data, ignoring any staleness checks, and refreshing the cache with revalidated, fresh data. A new --offline option will force npm to use the cache or exit. It will error with an ENOTCACHED code if anything it tries to install isn’t already in the cache. A standardised lockfile feature is available by default and will be for cross-package-manager compatibility (package-lock.json), and a new format and semantics for shrinkwrap. Downloads for large packages are streamed in and out of disk. npm is now able to install packages of any size without running out of memory. Last, it’s a bit faster. Demo Hopefully, they update their docs quickly with this new update and more users like me will be able to switch or access much of these key features. For detailed look into npm5’s features have a look at their official blog post in which they have listed every other breaking change coming with the new release. To start using the latest version of npm, you can in your terminal window or preferable shell: 12345npm install -g npm@next# Ornpm install -g npm@latest Subscribe my Blog for more on JavaScript/Nodejs/Ionic.","categories":[],"tags":[{"name":"npm","slug":"npm","permalink":"http://amandeepmittal.github.io/blog/tags/npm/"},{"name":"tips","slug":"tips","permalink":"http://amandeepmittal.github.io/blog/tags/tips/"}]},{"title":"Getting Started with Sequelize for Nodejs Applications","slug":"Getting-Started-with-Sequelize-for-Nodejs-Applications","date":"2017-05-30T09:37:43.000Z","updated":"2017-06-12T08:29:42.000Z","comments":true,"path":"2017/05/30/Getting-Started-with-Sequelize-for-Nodejs-Applications/","link":"","permalink":"http://amandeepmittal.github.io/blog/blog/2017/05/30/Getting-Started-with-Sequelize-for-Nodejs-Applications/","excerpt":"Introduction to ORMORM or Object Relation Mapping is a process of mapping between objects and relation database systems. An ORM acts like an interface between two system. ORM provide advantages for developers from basic ones like saving time and effort and rather focusing on business logic. The code is robust instead of redundant. ORM helps in managing queries for multiple tables in an effective manner. Lastly, an ORM (like sequelize) is capable to connect with different databases (which comes in handy when switching from one database to another).","text":"Introduction to ORMORM or Object Relation Mapping is a process of mapping between objects and relation database systems. An ORM acts like an interface between two system. ORM provide advantages for developers from basic ones like saving time and effort and rather focusing on business logic. The code is robust instead of redundant. ORM helps in managing queries for multiple tables in an effective manner. Lastly, an ORM (like sequelize) is capable to connect with different databases (which comes in handy when switching from one database to another). Getting Started with SequelizeSequelize is a promise-based ORM for Node.js. Sequelize is easy to learn and has dozens of cool features like synchronization, association, validation, etc. It also has support for PostgreSQL, MySQL, MariaDB, SQLite, and MSSQL. I am assuming you have some form of SQL database service started on your machine. I am currently using MySQL. InstallationSequelize is available via npm. 1234567$ npm install --save sequelize# And one of the following:$ npm install --save pg pg-hstore$ npm install --save mysql // For both mysql and mariadb dialects$ npm install --save sqlite3$ npm install --save tedious // MSSQL Setting up a ConnectionSequelize does setup a connection between the rest api/application and your SQL database. To setup basic connection between the two: 1234567891011121314const sequelize = new Sequelize('database', 'username', 'password', &#123; host: 'localhost', dialect: 'mysql'|'mariadb'|'sqlite'|'postgres'|'mssql', //choose anyone between them // To create a pool of connections pool: &#123; max: 5, min: 0, idle: 10000 &#125;, // For SQLite only storage: 'path/to/database.sqlite'&#125;); How do I setup my Sequelize Connection?For the sake brevity, I like to divide code into modules. After all, the Unix philosophy of one program/module should do one thing is major part of the philosophy behind writing code in JavaScript (and using Node.js as a server side platform) these days. I start with config.json/config.js file in the root of my application/api folder in which I define the general constraints needed to setup the connection with database: 1234567891011121314151617181920212223&#123; \"development\": &#123; \"username\": \"root\", \"password\": \"root\", \"database\": \"articles\", \"host\": \"localhost\", \"dialect\": \"mysql\" &#125;, \"test\": &#123; \"username\": \"root\", \"password\": \"root\", \"database\": \"articles\", \"host\": \"127.0.0.1\", \"dialect\": \"mysql\" &#125;, \"production\": &#123; \"username\": \"root\", \"password\": \"root\", \"database\": \"articles\", \"host\": \"127.0.0.1\", \"dialect\": \"mysql\" &#125;&#125; You can do this in your .env file if you like to follow that pattern. For more info on this see dotenv. After defining the configuration variables, in my models/ folder or where I define schema of tables in the database at application level, I create the connection in an index.js file: 1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950'use strict';const fs = require('fs');const path = require('path');const Sequelize = require('sequelize');const basename = path.basename(module.filename);const env = process.env.NODE_ENV || 'development';const config = require(__dirname + '/config.json')[env];const db = &#123;&#125;;if (config.use_env_variable) &#123; const sequelize = new Sequelize(process.env[config.use_env_variable]);&#125; else &#123; const sequelize = new Sequelize(config.database, config.username, config.password, config);&#125;fs .readdirSync(__dirname) .filter((file) =&gt; &#123; return (file.indexOf('.') !== 0) &amp;&amp; (file !== basename) &amp;&amp; (file.slice(-3) === '.js'); &#125;) .forEach((file) =&gt; &#123; const model = sequelize['import'](path.join(__dirname, file)); db[model.name] = model; &#125;);Object.keys(db).forEach((modelName) =&gt; &#123; if (db[modelName].associate) &#123; db[modelName].associate(db); &#125;&#125;);sequelize .authenticate() .then(() =&gt; &#123; console.log('Connection has been established successfully.'); &#125;) .catch((err) =&gt; &#123; console.log('Unable to connect to the database:', err); &#125;);db.sequelize = sequelize;db.Sequelize = Sequelize;// Import Models such that I can use them in the api just by importing 'db'db.user = require('./user')(sequelize, Sequelize);db.admin = require('./admin')(sequelize, Sequelize);db.articles = require('./articles')(sequelize, Sequelize);module.exports = db; It’s important to notice that I am exposing db object which contains every model/table schema definition and I just have to import the db object to apply operations on specific database tables using it. This setup can be auto-generated with the help of Sequelize CLI tool that helps in bootstrapping a new project in an effective manner (like the above) and handle database migrations directly from the terminal. ConclusionSequelize is feature rich ORM for Node.js. It has a documentation that at times may not provide direct solutions to your problems but there always Github issues for that. What I like about is its Promise based control flow. Coming from NoSQL background (and using MongoDB), understanding Sequelize really took less time. Most of the query based models are quite similar to that in MongoDB (especially the CRUD operations). I am looking for a brighter, more improved documentation and ease of support from Sequelize. Originally Published on Hackernoon.comSubscribe my Blog for more on JavaScript/Nodejs/Ionic.","categories":[],"tags":[{"name":"nodejs","slug":"nodejs","permalink":"http://amandeepmittal.github.io/blog/tags/nodejs/"},{"name":"mysql","slug":"mysql","permalink":"http://amandeepmittal.github.io/blog/tags/mysql/"},{"name":"sequelize","slug":"sequelize","permalink":"http://amandeepmittal.github.io/blog/tags/sequelize/"}]},{"title":"Atom- An Editor of 21st Century","slug":"Atom-An-Editor-of-21st-Century","date":"2017-05-25T18:30:01.000Z","updated":"2017-05-26T11:53:25.000Z","comments":true,"path":"2017/05/26/Atom-An-Editor-of-21st-Century/","link":"","permalink":"http://amandeepmittal.github.io/blog/blog/2017/05/26/Atom-An-Editor-of-21st-Century/","excerpt":"The Atom I am talking about is not a small particle in the world of developers. Built and maintained by Github and the community, it is more than just an editor.","text":"The Atom I am talking about is not a small particle in the world of developers. Built and maintained by Github and the community, it is more than just an editor. In our world, in the world of developers, an editor plays an amount of significant role when it comes to writing code. They might seem just a tool, as a matter of fact, they are, but for someone who takes pleasure in writing code, it is an essential piece in their setup. Using an editor is really a matter of choice, your comfort zone but the game of plugins have a big role to play. As yourself, I have tried my hands on different editors &amp; IDEs and for now I have decide to settle with Atom for its enormous amount of plugins available. Another reason for me is that it’s written in JavaScript (exactly CoffeScript &amp; since I am a JS enthusiast) and is completely free to use because of its open source normality. It is inspiring to open-source community as well. Few months back, Facebook released there version called Nuclide which focus more on mobile development. Then there is Electron for building cross-platform desktop application. Both are based on Atom Shell. Atom is mature in terms of plugins when comes to keeping the pace with newer technologies. When I started out with Node.js, I tried to stick with Webstorm IDE but soon Atom lured me for its support of frameworks like Ionic (a plugin called Ionic-Preview and I am still exploring) thanks to the community plugins and the other matter of fact that it’s open source. PackagesThere are more than 4.5k +packages published already. To view, Open the Settings view by clicking Packages &gt; Settings View &gt; Open in the menu bar or by using the (cmd + ,) keyboard shortcut. Atom Packages are categorized further into: Community packages: Packages written by people outside of GitHub’s Atom team. Core packages: These are developed by the Atom team and come bundled with Atom but you can disable them if they are no use to you. Development packages: Packages which you have on your machine and use in Atom from that local source. Core Packages do provide support for most favorable programming/scripting languages but if you are using something out of the box then you must check the Community packages. Chances of finding the one are in your favor there. If you are still unable to find what you are looking, you should try developing a package for yourself and then if you like share it with the community. TIP- Decreasing Startup TimeThere may come a period of time when your Atom might behave sluggishly. What will you do? You’ll remove all the packages (a.k.a plugins) you don’t use but for some reason you had them installed, or there isn’t much use of that particular package and you can do without it, or it was there just for fun. But before removing the packages, one must know which package is consuming how much startup time. You might want some of those unnecessary packages to stay with you if you know they are not the real culprits who are slowing down your development environment. I have seen (mostly on online forums) some developers groan about this kind of sluggishness but I haven’t met it yet. [UPDATE With Atom 1.17.0 -beta release, this sluggishness is almost nulll to feel.] Recommended PackagesMost of these packages are helpful in my daily JavaScript coding environment. I think they will be helpful to you too. open-recent(to continue where you left) sync-settings(do you work more than one machine? This for you) Ionic-Preview(for people who are working Ionic Framework) terminal-plus(terminal inside atom) atom-jade (there is support for ejs, handlebars, mustache too) jade(if you are into jade/pug, this is a snippets package) js-hyperclick (as your project goes bigger, you will get addicted to it) atom-lupa (nice one if your daily musings includes React/Angular) autocomplete-modules (Node.js devs: autocompletes require statements) atom-pair (developed by the guys at Pusher, a must if you do pair coding) javascript-snippets(JavaScript and Node.js snippets) atom-nodejs-snippets(this is another Nodejs &amp; JavaScript snippet package, made by me. Supports ES6 syntax) linter + linter-jshint atom-ternjs (JavaScript code intelligence for Atom) encourage (a nice one to have, if you are having a dark day, fun) The main advantage of an editor like Atom is that you can highly customize it. You can hack it, make your own packages, or use the one that are already there in the community and bend them as per your needs. Lastly Note: At the time of writing this post, Webstorm IDE did not have support for frameworks like Ionic and the latest Atom Version is 1.8.0. ORIGINALLY PUBLISHED: July, 14, 2016 here I haven’t covered all the plugins that I use but what I think are necessary. What about you? I would love to hear about the plugins you use. See My Packages for Atom: Jade Nodejs-Snippets Expressjs","categories":[],"tags":[{"name":"javascript","slug":"javascript","permalink":"http://amandeepmittal.github.io/blog/tags/javascript/"},{"name":"web development","slug":"web-development","permalink":"http://amandeepmittal.github.io/blog/tags/web-development/"},{"name":"atom","slug":"atom","permalink":"http://amandeepmittal.github.io/blog/tags/atom/"}]},{"title":"Concepts in Angularjs","slug":"Concepts-in-Angularjs","date":"2017-05-21T18:16:18.000Z","updated":"2017-06-12T08:41:44.000Z","comments":true,"path":"2017/05/21/Concepts-in-Angularjs/","link":"","permalink":"http://amandeepmittal.github.io/blog/blog/2017/05/21/Concepts-in-Angularjs/","excerpt":"AngularJS is a client side web application JavaScript framework, developed by Google that enhances HTML syntax. There are many options available when it comes picking up a client side framework as JavaScript has evolved fast in past two years. AngularJS 1.x the version we are discussing here, does not supports Mobile applications natively, for more info check Ionic Framework Overview.","text":"AngularJS is a client side web application JavaScript framework, developed by Google that enhances HTML syntax. There are many options available when it comes picking up a client side framework as JavaScript has evolved fast in past two years. AngularJS 1.x the version we are discussing here, does not supports Mobile applications natively, for more info check Ionic Framework Overview. Concepts in AngularJSAngularJS uses HTMl as template language as compared to some other frameworks. It enhances it by providing pre-defined custom HTML elements (in the form directives, and you can build your own custom). MVW?Angular uses either of MVC (Model-View-Controller) &amp; MVVM(Model-View-View-Model) architectural design patters to develop web applications. MVC promotes separation of concerns. In this, the View is separated from the Model through a controller which handles business logic and coordinates model and view. Here, Model represents the business data and View is the representation of that business data. Two-way Data Binding This concept provides synchronization between Model and View. It states: changes in Model are reflected in View and changes in View are instantly reflected back in Model. More info at: Guide: Two_Way_Data_Binding DirectivesTwo words define them: Custom HTML. They appear in the form of attributes that can be used with normal HTML elements and in the form elements as well. Built in directives are mostly prefixed with ng-. One most commonly used directive is: ng-app which is used to Bootstrap the application and the name of the application is passed as value. 1&lt;ng-app=\"myApp\"&gt; Dependency InjectionIt is a software design pattern that deals with how components get hold of their dependencies. Components such as services, directives, filters, and animations are defined by an injectable factory method or constructor function. These components can be injected with “service” and “value” components as dependencies. SPASPA stands for Single Page Application in which either all necessary HTML, CSS and JavaScript code is retrieved with a single page load or the appropriate resources are loaded dynamically usually in response to a user request. To fulfill a user request, Angular responses are managed via AJAX using HTTP verbs: GET, POST, PUT, DELETE, in most cases a RESTful API consisting endpoints at backend.","categories":[],"tags":[{"name":"angularjs","slug":"angularjs","permalink":"http://amandeepmittal.github.io/blog/tags/angularjs/"}]},{"title":"Modular programming in Angularjs","slug":"Modular-programming-in-Angularjs","date":"2017-05-18T17:18:57.000Z","updated":"2017-05-21T17:34:31.000Z","comments":true,"path":"2017/05/18/Modular-programming-in-Angularjs/","link":"","permalink":"http://amandeepmittal.github.io/blog/blog/2017/05/18/Modular-programming-in-Angularjs/","excerpt":"Source code of an angular application can be divided in two ways: by layers by features Modularization by LayersIn this, each type of a component goes into a particular module. The main app module is defined in app.js. 123456|--app/ |--app.js |--controller.js |--directive.js |--service.js|--index.html","text":"Source code of an angular application can be divided in two ways: by layers by features Modularization by LayersIn this, each type of a component goes into a particular module. The main app module is defined in app.js. 123456|--app/ |--app.js |--controller.js |--directive.js |--service.js|--index.html This type of modularization is useful for small component based applications. For a larger application, we have: Modularization by FeaturesIn this pattern, different module are declared separately. For example, the application currently has features such as login, signup, &amp; comments. The modularization will be done on the basis of these features: a login module, a signup module, and a comment module. 123456789101112131415|--app/ |--img/ #app level images |--css/ #app level stylesheets |--js/ #app level scripts |--app.js # main module |--modules/ |--login/ |--js/ |--controller.js |--service.js |--css/ |--img/ |--views/ | |--login.html |--loginModule.js","categories":[],"tags":[{"name":"angularjs","slug":"angularjs","permalink":"http://amandeepmittal.github.io/blog/tags/angularjs/"}]},{"title":"Setting up MEAN Stack with Webstorm","slug":"Setting-up-MEAN-Stack-with-Webstorm","date":"2017-05-05T04:30:41.000Z","updated":"2017-06-08T11:25:55.000Z","comments":true,"path":"2017/05/05/Setting-up-MEAN-Stack-with-Webstorm/","link":"","permalink":"http://amandeepmittal.github.io/blog/blog/2017/05/05/Setting-up-MEAN-Stack-with-Webstorm/","excerpt":"Ever since I got interested in Node.js and started learning to program in JavaScript, both the programming language and the server side platform have been most relevant to me. Due them, I have made my first PR to an open source project on Github, heck, I even built one of my own using them (see #100DaysOfCode) which currently has more than 6 people actively contributing and enhancing it.","text":"Ever since I got interested in Node.js and started learning to program in JavaScript, both the programming language and the server side platform have been most relevant to me. Due them, I have made my first PR to an open source project on Github, heck, I even built one of my own using them (see #100DaysOfCode) which currently has more than 6 people actively contributing and enhancing it. With Node.js, from quickly building server side application to build fullstack application is not much of a hassle. There are two important solutions to this: MEAN Stack &amp; Meteor.js. MEAN StackMEAN Stack is the used to create complete web development solutions. With JavaScript it’s base, it has lot of advantages to offer and the important of all is one programming language both on server and client side. No context switching. A perfect fullstack solution for me personally. MEAN is an acronym for MongoDB, ExpressJS, AngularJS, and Node.js. So instead of learning four different programming languages, you just need to know JavaScript. Setup MEAN Stack in WebstormI am sharing a video here which shows on how to get started with MEAN using JetBrain’s Webstorm (A JavaScript IDE) by John Lindquist. Subscribe my Blog for more on JavaScript/Nodejs/Ionic.","categories":[],"tags":[{"name":"nodejs","slug":"nodejs","permalink":"http://amandeepmittal.github.io/blog/tags/nodejs/"},{"name":"mean stack","slug":"mean-stack","permalink":"http://amandeepmittal.github.io/blog/tags/mean-stack/"},{"name":"tips","slug":"tips","permalink":"http://amandeepmittal.github.io/blog/tags/tips/"},{"name":"webstorm","slug":"webstorm","permalink":"http://amandeepmittal.github.io/blog/tags/webstorm/"}]},{"title":"How to start using ESLint in Node.js Applications?","slug":"Eslint-with-Nodejs","date":"2017-04-28T09:36:48.000Z","updated":"2017-06-08T11:25:32.000Z","comments":true,"path":"2017/04/28/Eslint-with-Nodejs/","link":"","permalink":"http://amandeepmittal.github.io/blog/blog/2017/04/28/Eslint-with-Nodejs/","excerpt":"ESLint is an open source JavaScript linting utility that help you overcome developer errors as JavaScript is loosely-typed language. There are quite a few options such as JSHint and JSCS in Javascript community for code linting and this post doesn’t suggest that you cannot use them.","text":"ESLint is an open source JavaScript linting utility that help you overcome developer errors as JavaScript is loosely-typed language. There are quite a few options such as JSHint and JSCS in Javascript community for code linting and this post doesn’t suggest that you cannot use them. ESLint is designed to have all rules completely pluggable. That’s one of the primary reasons it came into existence. It allows developers to create their own linting rules. Every rule provided in the ESLint official guide is standalone rule and a developer at any point can decide whether to use a specific rule or not. InstallingNote: You must have Node.js installed in order to access ESLint via it’s package manager npm. For local installation to a project directory: 1npm install eslint --save-dev For a global installation in your working system: 1npm install eslint -g ESLint will now be available via eslint command in your terminal. ConfigurationEasiest way to configure it to setup a .eslintrc JSON file where are all the linting rules can be described. An example of .eslintrc: 1234567891011121314&#123; \"env\": &#123; \"node\": 1, \"browser\": 1 &#125;, \"globals\": &#123; \"exampleGlobalVariable\": true &#125;, \"rules\": &#123; \"eqeqeq\": 1 &#125;, \"plugins\": [ ]&#125; If you installed eslint globally, you can also generate config file using 1eslint --init Other case, if you have installed it locally to a project, you will need to type in your terminal: 1./node_modules/.bin/eslint --init In both cases, you will be prompted with set of basic questions to generate .eslintrc file. An example of file generated after above prompt: 12345678910111213141516171819202122232425&#123; \"env\": &#123; \"browser\": true, \"commonjs\": true &#125;, \"extends\": \"eslint:recommended\", \"rules\": &#123; \"indent\": [ \"error\", \"tab\" ], \"linebreak-style\": [ \"error\", \"unix\" ], \"quotes\": [ \"error\", \"single\" ], \"semi\": [ \"error\", \"never\" ] &#125;&#125; For detailed information on Configuration, read here. RulesRules in ESLint are added individually. No rules are enforced by default. You have to specify rules explicitly, then only it will be enabled for the linting process. You can find a complete list of rules in the official documentation here After deciding which rules to include, you have to set there error levels. Each error level can be defined as following: 0 - Turn the rule off 1 - Turn the rule on as a warning 2 - Turn the rule on as an error The difference between an error and a warning is the exit code that eslint will have when it finishes. If any errors are found, eslint will exit with a 1 exit code, otherwise it will exit with a 0. If you are linting within a build step this allows you to control which rules should “break your build” and which ones should be considered as warnings. Learn how to configure rules in detail here. EnvironmentsThe code you are writing might be suitable for a particular environment such as, you might be writing a REST API in Node.js application using Express Framework (Sinatra) and the frontend of that application is going to be built in AngularJS. Two different projects, two different environments and both can have separate eslint configurations in one file even though the client and the server are under one project directory that is been considered as root of your project. How is it done? By setting the environment id to true in the &quot;env&quot; section of .eslintrc. LintingESLint comes with a command line interface (CLI) to lint your files or directory. 12elsint file.jseslint dir/ The output generated will be grouped by file, and will specify the line:column number, warning/error, reason for the error, and the name of the rule for each failure. Use ESLint with your preferred Coding StyleESLint personally does not promote any coding style. You can setup .eslintrc file to enforce coding style using style rules that you like. You can also use ESLint with Style guides such as JavaScript Standard Style. You have to use extra plugin for that. The full guide can be found here (https://github.com/feross/eslint-config-standard). To add a plugin to .eslintrc: 1\"plugins\": [ \"name-of-plugin\"] Some plugins for popular libraries: Angular | React Another plugin, I find very useful is one variable per var just to maintain code consistency over a large/open-source project. Subscribe my Blog for more on JavaScript/Nodejs/Ionic.","categories":[],"tags":[{"name":"eslint","slug":"eslint","permalink":"http://amandeepmittal.github.io/blog/tags/eslint/"},{"name":"nodejs","slug":"nodejs","permalink":"http://amandeepmittal.github.io/blog/tags/nodejs/"},{"name":"linting","slug":"linting","permalink":"http://amandeepmittal.github.io/blog/tags/linting/"},{"name":"mean stack","slug":"mean-stack","permalink":"http://amandeepmittal.github.io/blog/tags/mean-stack/"}]},{"title":"How Node.js Works?","slug":"How-Node-js-Works","date":"2017-04-19T05:54:37.000Z","updated":"2017-06-08T11:25:48.000Z","comments":true,"path":"2017/04/19/How-Node-js-Works/","link":"","permalink":"http://amandeepmittal.github.io/blog/blog/2017/04/19/How-Node-js-Works/","excerpt":"When I started learning Node.js I always wondered, how does it work? How is it inside Node.js? Event loop and Event Queue jargons are digested. But what exactly is going on? Where do those jargons Event Loop and Event Queue come from.To satisfy my curiosity as well to know the answer to my previous question, I went in depth as much as I can and came across some things which I’d like to share with you. In brief, this article is about Node.js System — a glimpse of internal workings of Node.","text":"When I started learning Node.js I always wondered, how does it work? How is it inside Node.js? Event loop and Event Queue jargons are digested. But what exactly is going on? Where do those jargons Event Loop and Event Queue come from.To satisfy my curiosity as well to know the answer to my previous question, I went in depth as much as I can and came across some things which I’d like to share with you. In brief, this article is about Node.js System — a glimpse of internal workings of Node. If you are familiar with Node.js, it is a known fact that Node.js is single threaded. If you are from programming/computer science background you know what a thread means. Consider this scenario: traditionally — an I/O request comes to a web server and is assigned to an available thread, and for each concurrent connection there is one thread available. That request is handled on the specific thread until it is fulfilled and the response is sent. This scenario is a perfect example of Blocking I/O because while handling a particular request by a specific thread, there will be some idle time when the operations are being done (such as retrieving a file, opening it, reading it, etc.). A single thread consumes memory. A longer running thread for each connection and then sitting idly for some amount of time is not considered an efficient way in the world of Node.js. Enter Reactor Pattern- Heart of Node.jsReactor Pattern is an idea of non-blocking I/O operations in Node.js. This pattern provides a handler(in case of Node.js, a callback function) that is associated with each I/O operation. When an I/O request is generated, it is submitted to a demultiplexer. This demultiplexer is a notification interface that is used to handle concurrency in non-blocking I/O mode and collects every request in form of an event and queues each event in a queue. Thus, the demultiplexer provides the Event Queue, which we often hear. When a request is collected by the demultiplexer, it returns the control back to the system and does not blocks the I/O. At the same time, there is an Event Loop which iterates over the items in the Event Queue. Every event has a callback function associated with it, and that callback function is invoked when the Event Loop iterates. The callback function further mostly have other callbacks associated within representing some asynchronous operations. These operations are inserted in the Event Queue by the demultiplexer and are ready to be processed once the Event Loop iterates over them. That is why calls to other operations must be asynchronous. When all the items in the Event Queue are processed and there are no pending operations left, Node.js terminates the application automatically. Building Blocks of Node.js Reactor Pattern libuv A set of Bindings Chrome’s V8 Core JS Library libuvPronounced as “lib u v”, is library written in C language to make Node.js compatible with every OS and provide the non-blocking I/O behaviour. libuv is a low-level engine that implements reactor pattern thus providing an API for creating the Event Loop, managing an Event Queue and running asynchronous I/O operations. It is built specifically to provide a unified experience over different Operating Systems. Need for libuv?Each operating system has its own interface for the demultiplexer. Such as Kqueue for Mac OS X, IOCP for Windows and Epoll for Linux. Different multiplexers will behave differently when handling an I/O request. And then, each I/O operation can differ in its behaviour within the same operating system. This creates an inconsistency and to overcome this inconsistency libuv is the solution. I am not going to talk about internal workings of libuv here, not an expert on that, myself. For more info on libuv check their docs or this slide by Saúl Ibarra Corretgé (@saghul) is a good start. Also, libuv is independently maintained by awesome developers. Set of BindingsThese set of bindings are responsible for wrapping and exposing libuv and other low-level functionality to JavaScript. V8It’s a runtime engine developed by Google for Chrome browser for JavaScript. It is the reason Node.js is fast and efficient. Core LibraryThis is a JavaScript library that implements high-level Node.js API (a.k.a. node-core). Subscribe my Blog for more on JavaScript/Nodejs/Ionic.","categories":[],"tags":[{"name":"nodejs","slug":"nodejs","permalink":"http://amandeepmittal.github.io/blog/tags/nodejs/"}]},{"title":"Modules in Angularjs","slug":"Modules-in-Angularjs","date":"2017-04-14T06:50:12.000Z","updated":"2017-06-08T11:26:02.000Z","comments":true,"path":"2017/04/14/Modules-in-Angularjs/","link":"","permalink":"http://amandeepmittal.github.io/blog/blog/2017/04/14/Modules-in-Angularjs/","excerpt":"Modules are essential part of developing an AngularJS application. Modules provide resusability of code. A module in AngularJS act as a container that holds/groups different components.","text":"Modules are essential part of developing an AngularJS application. Modules provide resusability of code. A module in AngularJS act as a container that holds/groups different components. Creating a simple Moduleangular.module function is used to create a module whenever necessary. The first argument is always the module name and the second argument is an array that specifies additional modules upon which are current module depends. If there’s no dependency, pass an empty array 12345// module with no dependencyangular.module('moduleA', []);// module with dependenciesangular.module('moduleB', ['moduleA', 'moduleC']); After creating a module, different components are bind with it. 12345var myModule = angular.module('moduleA', []);myModule.controller(...);myModule.service(...); The above code creates a new module and attaches two components with it: a controller, and a directive. It also declares a global variable myModule in the JavaScript global namespace. Imagine a large app with vast amount of global variables like this. To avoid this situation of populating JavaScript global namespace, we can declare the whole code inside an IIFE. 123456789(function() &#123; var myModule = angular.module('moduleA', []); myModule.controller(...); myModule.service(...);&#125;)();// myModule is undefined here This function will execute as soon as it’s declared. There’s alternative procedure in which IIFE can be avoided, and is simple. Call the Angular Module with a single argument. When an angular module is called with a single argument, it retrieves the already created module and returns it. 1234angular.module('moduleA', []);angular.module('firstModule').controller(...);angular.module('firstModule').directive(...); Alternatively, to avoid boilerplate, components such as controllers and directives can be chained with the module declaration. 123angular.module('moduleA', []) // notice no semicolon.controller(...).directive(...); // notice the semicolon Subscribe my Blog for more on JavaScript/Nodejs/Ionic.","categories":[],"tags":[{"name":"angularjs","slug":"angularjs","permalink":"http://amandeepmittal.github.io/blog/tags/angularjs/"}]},{"title":"The Node Way: Philosophy of a Platform","slug":"The-Node-Way-Philosophy-of-a-Platform","date":"2017-04-05T13:01:29.000Z","updated":"2017-05-21T17:41:26.000Z","comments":true,"path":"2017/04/05/The-Node-Way-Philosophy-of-a-Platform/","link":"","permalink":"http://amandeepmittal.github.io/blog/blog/2017/04/05/The-Node-Way-Philosophy-of-a-Platform/","excerpt":"Last week, when Node.js community introduced its logo, it got me into thinking of why this technology as fresh in my mind as when I was first introduced to it a few months back. Why is that spark still ignited in the back of my head? The answer to this is the philosophy behind the technology of Node.js platform.","text":"Last week, when Node.js community introduced its logo, it got me into thinking of why this technology as fresh in my mind as when I was first introduced to it a few months back. Why is that spark still ignited in the back of my head? The answer to this is the philosophy behind the technology of Node.js platform. Every platform has its own philosophy, its own set of rules, its own principles and guidelines. This is necessary for the evolution of a platform and is important for developing an application using that platform. (Otherwise, we all can get carried away.) Node.js has its own philosophy, since its a platform, and it manages to find a middleground between JavaScript and UNIX. Two of the most important principles of UNIX that are adaptable in Node.js are: Modularity, keeping simple parts short, connected with clean interfaces. A program should do one thing and it should do that awesomely. Other rules described by Eric Steven Raymond in The Art of UNIX Programming might fit to some extent but the two aforementioned are necessary to use Node.js pragmatically. In Node.js this pragmaticism is provided the by a ‘module’. A module is the fundamental to structure the code of a program in Node.js. Module is also the building block of a package. (A package is any application or reusable libraries). The principle here is to design small modules in terms of code and in terms of application scope. This principle provides: reusability of code easier to understand the code thus, making it simple to test and maintain Another important aspect in the Node Philosophy is the dependency of each package. Writing a Node.js application, one tends to use a lot of packages (which is the genesis of Node.js Ecosystem: npm) and this might create a common problem known as: dependency hell. To overcome this conflict, Node.js manages dependencies of each installed package to have its own separate set of dependencies. ORIGINALLY PUBLISHED at Medium.com on March 10, 2016.","categories":[],"tags":[{"name":"nodejs","slug":"nodejs","permalink":"http://amandeepmittal.github.io/blog/tags/nodejs/"}]},{"title":"JavaScript Code Conventions","slug":"JavaScript-Code-Conventions","date":"2017-04-03T17:31:43.000Z","updated":"2017-05-21T17:34:21.000Z","comments":true,"path":"2017/04/03/JavaScript-Code-Conventions/","link":"","permalink":"http://amandeepmittal.github.io/blog/blog/2017/04/03/JavaScript-Code-Conventions/","excerpt":"This article is about coding conventions. Everywhere I read good/better/awesome articles but very few seem to talk about the the basic things in programming.","text":"This article is about coding conventions. Everywhere I read good/better/awesome articles but very few seem to talk about the the basic things in programming. Like the coding conventions used by programmers in their work. I am a JavaScript enthusiast and never once did I came across a good article on basic conventions and guidelines to write code that is helpful for me and others to read my code.Thus, this is my attempt and this article contains some general coding conventions as well as some specific guidelines only applicable to JavaScript. Thus, this is my attempt and this article contains some general coding conventions as well as some specific guidelines only applicable to JavaScript. So what are Code Conventions?These are the guidelines about programming practices, file and directory structure and commenting. Now you may be wondering why do you need guidelines as for files and directory structure? Well, to keep simple and when working in a team you have to follow some rules for a specific file structure for that application. Otherwise it will be huge mess. Style GuidelinesThey are the type of Code Convention that includes the layout of code within a file. IndentationThe first thing to do when writing code in a file is how to handle indentation. 12345678910if(num===1)&#123; for(i=0;i&lt;array.length;i++)&#123; if(array[i]!==0)&#123; //some code &#125; else if(array[i]===array.length)&#123; // code &#125; &#125;&#125; Observe in the previous example there is a flow. This is what an indentation is all about. It makes the program readable. The else if statement is used for the if statement inside the for loop and not the outside if statement. Two ways to achieve indentation: using tabs using spaces Using TabsFor each indentation level, use one tab character. Thus, the second level will have two tab characters and so on. Using SpaceEach indentation level is made up of multiple spaces. The levels contains spaces in pairs, like two spaces for first level, and four spaces for second level and so on. The advantage of using spaces over tabs is that all text editors are configured according to spaces and is treated exactly the same. The disadvantage here is to put spaces in each line. Thankfully, we are in an era where text editors are smart enough and they automatically do indentation. Avoid ASI Automatic Semicolon InsertionAvoiding semicolons is possible and if JavaScript has a mechanism called ASI, why the hell to care about semicolons? If you are comfortable with ASI carry on. But the rules of ASI are complex and using your time with in writing code rather than worrying about ASI is better. It causes errors and sometimes things won’t work because the JavaScript parser may read things different from the way they are written. Also, semicolons improves the readability of the code for other programmers too. If you are working collaboratively, it’s a great help. Avoid Horizontal ScrollingThe recommended length of code in a line is 80 characters. Even though the text editors have become smart, the length of 80 characters has is still used as a convention. Blank Lines are not harmfulUsing blank lines to separate unrelated lines of code. It improves readability. Without blank lines: 12345678910if(num===1)&#123; for(i=0;i&lt;array.length;i++)&#123; if(array[i]!==0)&#123; //some code &#125; else if(array[i]===array.length)&#123; // code &#125; &#125;&#125; With blank lines:12345678910if(num===1)&#123; for(i=0;i&lt;array.length;i++)&#123; if(array[i]!==0)&#123; //some code &#125; else if(array[i]===array.length)&#123; // code &#125; &#125;&#125; Naming ConventionECMAScript uses camelCase convention. You should too when naming Variables and Functions. And try to use meaningful names for those variables and functions and keep them short. Function NamingIn JS, all we do is make functions in form of callbacks andevents. Author of Maintainable Javascript Nicholas Zakas introduces some common conventions for functions. I find these helpful: can Function that returns a boolean has Function that returns a boolean is Function that returns a boolean get Function that returns a nonboolean set Function that is used to save a value ConstructorsConstructors are functions too and are used to create objects via new operator. But avoid using camelCase and use PascalCase instead. It is helpful since JavaScript uses the same for naming pre-defined constructors. CommentsFor single-line comments, I observed this when using JSHint, after // use a space between them(the two slashes) and the comment. 1// Single-Line Comment Following all conventions of can be hard and a stressful matter at times when you are focusing on the logic part of the code. Thus, there is an alternative which works for me most of the time, is the Beautify package that I use in the text editor Atom and I am sure it is available for the majority of other text editors. Subscribe to my newsletter ORIGINALLY PUBLISHED at Medium.com on January 8, 2016.","categories":[],"tags":[{"name":"javascript","slug":"javascript","permalink":"http://amandeepmittal.github.io/blog/tags/javascript/"}]}]}